<template>

    <div class="wt_wrap" style="margin-top:20px">
        <el-card class="box-card">
            <div class="main_header" style="margin-bottom:30px;">常见问题</div>
            <!-- <div class="main_header2" style="text-align:center;margin-bottom:20px;color:#999">我们服务过2000+企业，感谢客户的选择和信任，我们将与这些优秀企业共同成长。</div> -->
            <div class="">
                <el-collapse accordion v-model="active">
                    <el-collapse-item v-for="(item,i) in list" :key="i" :name="item.title">
                        <template slot="title">
                            <!-- <div> -->
                            <div style="font-size:26px;color:#666;margin:20px 0 0 20px;;" :class="{'active':item.title===active}">{{item.title}}<i class="header-icon el-icon-info" color="red"></i></div>
                            <!-- <br> -->
                            <div style="font-size:16px;color:#666;margin:0 0 0 20px;;">{{item.wt}}</div>
                            <!-- </div> -->

                        </template>
                        <div v-html="item.jd"></div>
                    </el-collapse-item>
                    <!-- <el-collapse-item>
                        <template slot="title">
                            一致性 Consistency<i class="header-icon el-icon-info"></i>
                        </template>
                        <div>与现实生活一致：与现实生活的流程、逻辑保持一致，遵循用户习惯的语言和概念；</div>
                        <div>在界面中一致：所有的元素和结构需保持一致，比如：设计样式、图标和文本、元素的位置等。</div>
                    </el-collapse-item>
                    <el-collapse-item title="反馈 Feedback">
                        <div>控制反馈：通过界面样式和交互动效让用户可以清晰的感知自己的操作；</div>
                        <div>页面反馈：操作后，通过页面元素的变化清晰地展现当前状态。</div>
                    </el-collapse-item>
                    <el-collapse-item title="效率 Efficiency">
                        <div>简化流程：设计简洁直观的操作流程；</div>
                        <div>清晰明确：语言表达清晰且表意明确，让用户快速理解进而作出决策；</div>
                        <div>帮助用户识别：界面简单直白，让用户快速识别而非回忆，减少用户记忆负担。</div>
                    </el-collapse-item>
                    <el-collapse-item title="可控 Controllability">
                        <div>用户决策：根据场景可给予用户操作建议或安全提示，但不能代替用户进行决策；</div>
                        <div>结果可控：用户可以自由的进行操作，包括撤销、回退和终止当前操作等。</div>
                    </el-collapse-item> -->
                </el-collapse>
            </div>
        </el-card>
    </div>
</template>

<script>
export default {
    name: 'Banner',
    components: {},
    props: {},
    watch: {},
    data() {
        return {
            active: '',
            list: [
                {
                    title: '申请条件',
                    wt: '什么样的公司可以申请？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '认证周期',
                    wt: '审核需要多长时间？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '资源投入',
                    wt: '需要投入多少人力和工作量？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '资质维护',
                    wt: '证书有效期是多久？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '申请级别',
                    wt: '我应该申请哪个级别？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '模型选择',
                    wt: '应该采用哪个模型？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '过级企业名单',
                    wt: '如何判断企业是否通过CMMI认证？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '审核资质',
                    wt: '如何判断咨询公司是否具备评估资质？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
                {
                    title: '审核员资质',
                    wt: '如何判断审核员是否具备审核资质？',
                    jd: '<p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p><p>回答内充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充回答内容待补充</p>',
                },
            ],
        }
    },

    mounted() {},
    beforeDestroy() {},
    methods: {},
}
</script>

<style lang="less" scoped>
.wt_wrap {
    margin: 0 auto;
    max-width: 1360px;
    /deep/ .el-collapse-item__header {
        height: auto;
        line-height: auto;
        display: block;
        position: relative;
    }
    .active {
        color: #007dc6 !important;
    }
    /deep/ .el-collapse-item__arrow {
        position: absolute;
        right: 10px;
        top: 20px;
    }
    /deep/ .el-collapse-item__content {
        color: #999;
        margin: 0 0 0 20px;
    }
}
</style>